#include "led.h"



/**
******************************************************************************
* @file      ：.\Drivers\BSP\src\led.c
*              .\Drivers\BSP\inc\led.h
* @author    ：XRbin
* @version   ：V1.0
* @date      ：2023-06-16
* @brief     ：LED灯驱动配置代码
******************************************************************************
* @attention
*   我的GitHub   ：https://github.com/XR-bin
*   我的gitee    ：https://gitee.com/xrbin
*   我的leetcode ：https://leetcode.cn/u/xrbin/
******************************************************************************
*/



/**********************************************************
* @funcName ：LED_Init
* @brief    ：对LED对应的GPIO口进行初始化设置
* @param    ：void
* @retval   ：void
* @details  ：
*            LED0     PF9
*            LED1     PF10
*            高电平灭，低电平亮-----输出模式
* @fn       ：
************************************************************/
void LED_Init(void)
{
    /* 端口时钟使能   GPIOF */
    RCC->AHB1ENR |= (1<<5);

    /* 端口模式配置 */
    GPIOF->MODER &= ~((3<<(2*9))|(3<<(2*10)));
    GPIOF->MODER |= ((1<<(2*9))|(1<<(2*10)));      /* 通用输出模式 */
    /* 端口输出类型配置 */
    GPIOF->OTYPER &= ~((1<<9)|(1<<10));            /* 推挽输出 */
    /* 端口输出速度配置 */
    GPIOF->OSPEEDR &= ~((3<<(2*9))|(3<<(2*10)));
    GPIOF->OSPEEDR |= ((2<<(2*9))|(2<<(2*10)));    /* 速度为50MHz */

    /* 端口输出数据寄存器配置 */
    /* 先将LED都关闭 */
    GPIOF->ODR |= ((1<<9)|(1<<10));         /* 高电平灭 */
} 








