#include "pwm.h"



/**
******************************************************************************
* @file      ：.\Drivers\BSP\src\pwm.c
*              .\Drivers\BSP\inc\pwm.h
* @author    ：XRbin
* @version   ：V1.0
* @date      ：2023-07-27
* @brief     ：pwm练习代码
******************************************************************************
* @attention
*   我的GitHub   ：https://github.com/XR-bin
*   我的gitee    ：https://gitee.com/xrbin
*   我的leetcode ：https://leetcode.cn/u/xrbin/
******************************************************************************
*/



/**********************************************************
* @funcName ：TIM14_PWM_Init
* @brief    ：对通用定时器14进行初始化设置并输出PWM
* @param    ：uint16_t arr (重载值)
* @param    ：uint16_t psc (预分频值)
* @param    ：uint16_t ccr (比较值/占空比)
* @retval   ：void
* @details  ：
*            PWM输出口  PF9   TIM14_CH1  输出通道1
* @fn       ：
*            有效电平为高电平
*            定时器向上计数
*            先输出有效电平后输出无效电平
************************************************************/
void TIM14_PWM_Init(uint16_t arr, uint16_t psc, uint16_t ccr)
{
    /* GPIOx时钟使能 */
    RCC->AHB1ENR |= (1<<5);             /* GPIOF */
    /* 端口模式寄存器 */
    GPIOF->MODER &= ~(3<<(2*9));
    GPIOF->MODER |= (2<<(2*9));         /* 复用输出 */
    /* 端口输出类型寄存器 */
    GPIOF->OTYPER &= ~(1<<9);           /* 推挽 */
    /* 端口输出速度寄存器 */
    GPIOF->OSPEEDR |= (3<<(2*9));
    /* 复用功能寄存器 */
    GPIOF->AFR[1] &= ~(0xf<<(9-8));
    GPIOF->AFR[1] |= (0x9<<(9-8));      /* 复用 */

    /* 定时器设置部分 */
    /* 开启TIMx时钟 */
    RCC->APB1ENR |= 1<<8;               /* 定时器14 */
    /* 控制寄存器1  CR1 */
    TIM14->CR1 &= ~(0xffff);
    TIM14->CR1 |= 1<<7;                 /* 自动重装载预装载使能 */
    /* 从模式控制寄存器(选择内部时钟源) */
    TIM14->SMCR &= ~(7<<0);
    /* 预分频器 */
    TIM14->PSC = psc;
    /* 自动重载寄存器 */
    TIM14->ARR = arr;
    /* 捕获/比较模式寄存器1 */
    TIM14->CCMR1 &= ~(0xff);
    TIM14->CCMR1 |= 0x68;              /* 开启预装载功能，向上计数时先输出有效，向下计数时先输出无效 */
    /* 捕获/比较使能寄存器 */
    TIM14->CCER &= ~(0xf);             /* 高电平为有效电平 */
    TIM14->CCER |= 1<<0;               /* 使能输出 */
    //捕获/比较寄存器1
    TIM14->CCR1 = ccr;                 /* 设置比较值 */
    /* 事件生成寄存器 */
    TIM14->EGR |= 1<<0;                /* 触发更新 */
    /* 清除事件生成标志 */
    TIM14->SR &= ~(1<0);

    /* 计算器使能 */
    TIM14->CR1 |= 1<<0;
}



