#include "sys.h"

/*****************************************************
*函数功能  ：对USART1对应的GPIO口进行初始化设置
*函数名    ：USART1_Init
*函数参数  ：u32 baud
*函数返回值：void
*描述      ：
            PA9     TX     ---------输出
            PA10    RX     ---------输入
********************************************************/
void USART1_Init(u32 baud)
{
  /*GPIO口初始化*/
  //端口时钟使能
  RCC->APB2ENR |= (1<<2);
  //端口配置寄存器
  GPIOA->CRH &= ~((0xf<<4*(9-8))|(0xf<<4*(10-8)));
  GPIOA->CRH |= (11<<4*(9-8));
  GPIOA->CRH |= (4<<4*(10-8));
  //重复映射寄存器
  AFIO->MAPR2 &= ~(1<<2);
  
  //外设时钟复位寄存器
  RCC->APB2RSTR |= (1<<14);
  RCC->APB2RSTR &= ~(1<<14);
  
  /*串口寄存器初始化*/
  //串口1时钟使能
  RCC->APB2ENR |= (1<<14);
  //控制寄存器RC1
  USART1->CR1 &= ~(1<<12);
  USART1->CR1 |= (1<<2)|(1<<3);
  //控制寄存器RC2
  USART1->CR2 &= ~(3<<12);
  //波特率寄存器
  USART1->BRR = 72*1000000/baud;
  //串口使能
  USART1->CR1 |= (1<<13);
}

/*****************************************************
*函数功能  ：串口1发送一个字节的数据（u8）
*函数名    ：USART1_Send_Byte
*函数参数  ：u8 data
*函数返回值：void
*描述      ：
            PA9     TX     ---------输出
            PA10    RX     ---------输入
********************************************************/
void USART1_Send_Byte(u8 data)
{
  while(!(USART1->SR & (1<<6)));
  USART1->DR = data;
}

/***************************************************
*函数功能  ：串口1接收一个字节的数据
*函数名    ：USART1_Receive_Byte
*函数参数  ：void
*函数返回值：u8 data
*描述      ：
            PA9    TX
            PA10   RX
*****************************************************/
u8 USART1_Receive_Byte(void)
{
  u8 data;
  
  while(!(USART1->SR & (1<<5)));
  data = USART1->DR;
  
  return data;
}











