#include "sys.h"

/*****************************************************
*函数功能  ：对LED对应的GPIO口进行初始化设置
*函数名    ：LED_Init
*函数参数  ：void
*函数返回值：void
*描述      ：
             LED0     PB5
             LED1     PE5
             高电平灭，低电平亮-----输出模式
********************************************************/
void LED_Init(void)
{
  //CPIOx时钟使能
  RCC->APB2ENR |= ((1<<3)|(1<<6));
  
  //端口配置寄存器
  GPIOB->CRL &= ~(0xf<<4*5);
  GPIOB->CRL |= (3<<4*5);
  
  GPIOE->CRL &= ~(0xf<<4*5);
  GPIOE->CRL |= (3<<4*5);
  
  //端口数据输出寄存器
  GPIOB->ODR |= (1<<5);
  GPIOE->ODR |= (1<<5);
}









