#include "stm32f4xx.h"             

/******************************************************************
*函数功能  ：对串口1对应的GPIO口进行初始化和对串口1的寄存器进行设置
*函数名    ：USART1_Init
*函数参数  ：u32 baud
*函数返回值：void
*描述      ：
            PA9   TX    输出
            PA10  RX    输入
*******************************************************************/
void USART1_Init(u32 bps)
{
  /*GPIO口配置*/
  //端口时钟使能   GPIOA
  RCC->AHB1ENR |= 1<<0;
  //端口模式配置
  GPIOA->MODER &= ~((3<<2*9)|(3<<2*10));
  GPIOA->MODER |= ((2<<2*9)|(2<<2*10));      //复用功能
  //端口输出类型配置
  GPIOA->OTYPER &= ~(1<<9);                  //推挽输出
  //端口输出速度配置
  GPIOA->OSPEEDR &= ~(3<<2*9);
  GPIOA->OSPEEDR |= (2<<2*9);                //速度50MHz
  //端口输入上下拉
  GPIOA->PUPDR &= ~(3<<10);                  //无上下拉
  //复用功能寄存器
  GPIOA->AFR[1] &= ~((0xf<<4*(9-8))|(0xf<<4*(10-8)));  //PA9 复用为USART1的输出(TX)
  GPIOA->AFR[1] |= ((0x7<<4*(9-8))|(0x7<<4*(10-8)));   //PA10复用为USART1的输入(RX)
  
  /*串口1初始化*/
  //串口1时钟使能   USART1
  RCC->APB2ENR |= 1<<4;
  //控制寄存器CR1
  USART1->CR1 &= ~((1<<15)|(1<<12)|(1<<3)|(1<<2));     
  USART1->CR1 |= ((1<<3)|(1<<2));    
  //控制寄存器CR2
  USART1->CR2 &= ~(3<<12);
  //波特率寄存器
  USART1->BRR = 84*1000000/bps;
  //串口1使能
  USART1->CR1 |= 1<<13;
}

/******************************************************************
*函数功能  ：串口1发送一个字节数据（8位）
*函数名    ：USART1_Send_Byte
*函数参数  ：u8 data
*函数返回值：void
*描述      ：
            PA9   TX    输出
            PA10  RX    输入
*******************************************************************/
void USART1_Send_Byte(u8 data)
{
  while(!(USART1->SR & (1<<6)));
  USART1->DR = data;
}

/******************************************************************
*函数功能  ：串口1接收一个字节数据（8位）
*函数名    ：USART1_Receive_Byte
*函数参数  ：void
*函数返回值：u8 
*描述      ：
            PA9   TX    输出
            PA10  RX    输入
*******************************************************************/
u8 USART1_Receive_Byte(void)
{
  u8 data;
  
  while(!(USART1->SR & (1<<5)));
  data = USART1->DR;
  
  return data;
}









