#include "sys.h"
#include "led.h"
#include "delay.h"
#include "led.h"

/*****************************************************
*函数功能  ：对LED对应的GPIO口进行初始化设置
*函数名    ：LED_Init
*函数参数  ：void
*函数返回值：void
*描述      ：
             LED0     PB5
             LED1     PE5
             高电平灭，低电平亮-----输出模式
********************************************************/
void LED_Init(void)
{
  //CPIOx时钟使能
  RCC->APB2ENR |= ((1<<3)|(1<<6));
  
  //端口配置寄存器
  GPIOB->CRL &= ~(0xf<<4*5);
  GPIOB->CRL |= (3<<4*5);
  
  GPIOE->CRL &= ~(0xf<<4*5);
  GPIOE->CRL |= (3<<4*5);
  
  //端口数据输出寄存器
  GPIOB->ODR |= (1<<5);
  GPIOE->ODR |= (1<<5);
}

/************************************************************
*函数功能  ：关灯
*函数名    ：LED_OFF
*函数参数  ：void
*函数返回值：void
*描述      ：
***************************************************************/
void LED_OFF(void)
{
  LED0_OFF;
  LED1_OFF;
}

/************************************************************
*函数功能  ：关灯
*函数名    ：LED_ON
*函数参数  ：void
*函数返回值：void
*描述      ：
***************************************************************/
void LED_ON(void)
{
  LED0_ON;
  LED1_ON;
}

/************************************************************
*函数功能  ：流水灯
*函数名    ：LED_Flash1
*函数参数  ：void
*函数返回值：void
*描述      ：
***************************************************************/
void LED_Flash1(void)
{
  LED0_ON;
  LED1_OFF;
  delay_ms(300);
  LED0_OFF;
  LED1_ON;
  delay_ms(300);
}

/************************************************************
*函数功能  ：流水灯
*函数名    ：LED_Flash1
*函数参数  ：void
*函数返回值：void
*描述      ：
***************************************************************/
void LED_Flash2(u8 n)
{
  LED0_ON;
  LED1_OFF;
  delay_ms(100*n);
  LED0_OFF;
  LED1_ON;
  delay_ms(100*n);
}








