#include "sys.h"

/*****************************************************
*函数功能  ：对LED对应的GPIO口进行初始化设置
*函数名    ：LED_Init
*函数参数  ：void
*函数返回值：void
*描述      ：
             LED0     PB5
             LED1     PE5
             高电平灭，低电平亮-----输出模式
********************************************************/
void LED_Init(void)
{
  //端口时钟使能
  RCC->APB2ENR |= (1<<3);   //GPIOB时钟
  RCC->APB2ENR |= (1<<6);   //GPIOE时钟
  //端口模式配置
  //端口输出类型配置
  //端口输出速度配置 
  GPIOB->CRL &= ~(0xF<<4*5);
  GPIOB->CRL |= (3<<4*5);
  
  GPIOE->CRL &= ~(0xF<<4*5);
  GPIOE->CRL |= (3<<4*5);

  //端口输出数据寄存器配置   //LED灯的初始状态
  GPIOB->ODR |= (1<<5);
  GPIOE->ODR |= (1<<5);
}













