#include "sys.h"
#include "stdio.h"

/*************************************************************************
*函数功能  ：对通用定时器4进行初始化设置并捕获脉冲信号
*函数名    ：TIM4_Capture_Init
*函数参数  ：void
*函数返回值：u16 arr,u16 psc
*描述      ：通过测量另一个定时器的占空比
*            脉冲输入口 ： PB6   TIM4_CH1  输入通道1  映射通道IC1、IC2
*****************************************************************************/
void TIM4_Capture_Init(u16 arr,u16 psc)
{
  u32 pri;
  
  /*GPIOx配置部分*/
  //GPIOx时钟使能
  RCC->APB2ENR |= 1<<3;
  //端口配置寄存器
  GPIOB->CRL &= ~(0xf<<(4*6));
  GPIOB->CRL |= (0x8<<(4*6));
  GPIOB->ODR |= 0<<6;		//PB6 下拉
  //复用重映射寄存器
  RCC->APB2ENR |= 1<<0;
  AFIO->MAPR &= ~(1<<12);
  
  /*TIMx配置*/
  //TIMx时钟使能
  RCC->APB1ENR |= 1<<2;
  //控制寄存器1  CR1
  TIM4->CR1 &= ~(0xffff);
  TIM4->CR1 |= 1<<7;      //使能影子寄存器
  //从模式控制寄存器
  TIM4->SMCR &= ~(7<<4);
  TIM4->SMCR |= (5<<4);     //滤波后的定时器输入 1 (TI1FP1)
  TIM4->SMCR &= ~(7<<0);
  TIM4->SMCR |= (4<<0);     //复位模式
  
  /*********ICC1*********/
  //捕获比较模式寄存器1
  TIM4->CCMR1 &= ~(0xf<<4);
  TIM4->CCMR1 |= 0x3<<4;     //频率最小   8次采样   
  TIM4->CCMR1 &= ~(3<<0);
  TIM4->CCMR1 |= 1<<0;       //通道CH1进来的信号用通道IC1去捕获
  //捕获比较使能寄存器
  TIM4->CCER &= ~(1<<1);     //上升沿捕获
  TIM4->CCER |= 1<<0;        //使能捕获
  
  /*********ICC2**********/
  //捕获比较模式寄存器1
  TIM4->CCMR1 &= ~(0xf<<12);
  TIM4->CCMR1 |= 0x3<<12;     //频率最小   8次采样   
  TIM4->CCMR1 &= ~(3<<8);
  TIM4->CCMR1 |= 2<<8;       //通道CH1进来的信号用通道IC2去捕获
  //捕获比较使能寄存器
  TIM4->CCER |= (1<<5);      //下降沿捕获
  TIM4->CCER |= 1<<4;        //使能捕获
  
  //中断还能寄存器
  TIM4->DIER |= (1<<1); //使能 CC1 中断
	TIM4->DIER |= (1<<2); //使能 CC2 中断

  //预分频器
  TIM4->PSC = psc;
  //自动重装载寄存器
  TIM4->ARR = arr;
  //事件生成寄存器
  TIM4->EGR |= 1<<0;
  //清除事件生成标志
  TIM4->SR &= ~(1<0);
  
  /*NVIC配置*/
  //中断分组（在主函数）
  //计算中断优先级编码中断
  pri = NVIC_EncodePriority (5, 1, 2);  //5号分组形式，抢占1级，响应2级
  //将编码写入中断源
  NVIC_SetPriority(TIM4_IRQn,pri);
  //使能NVIC通道
  NVIC_EnableIRQ(TIM4_IRQn);
  
  //TIMx使能
  TIM4->CR1 |= 1<<0;
}

/*********************************************
*函数功能  ：定时器9中断函数
*函数名    ：TIM1_BRK_TIM9_IRQHandler ：
*函数参数  ：void     
*函数返回值：void
*函数描述  ：
* 					 判断是定时9的通道1的重复捕获标志
* 							清标志位
* 							读CCR1
*
* 					 判断是定时9的通道2的捕获标志
* 							清标志位
*               读CCR2
*********************************************/
void TIM4_IRQHandler(void)
{
	static u16 data_2;
	u16 data_1;
	u16 p_val;
	
	if(TIM4->SR & (1<<2))
	{
		//清除捕通道2的获标志位
		TIM4->SR &= ~(1 << 2);
		//紧急事件
		//CCR2
		data_2 = TIM4->CCR2;	
	}
	
	if(TIM4->SR & (1<<9))
	{
		//清除通道1的捕获标志位
		TIM4->SR &= ~(1 << 1);
		//清除通道1重复捕获标志位
		TIM4->SR &= ~(1 << 9);
		//紧急事件
		//记录值CCR1
		data_1 = TIM4->CCR1;
		//计算周期和占空比
		
		p_val = (float)data_2/data_1*100;
		
		printf("周期：%d   高电平：%d   占空比：%d%%\r\n",data_1,data_2,p_val);	
	}

}




