#include "stm32f4xx.h"    

/*****************************************************
*函数功能  ：对独立看门狗进行配置
*函数名    ：IWDG_Init
*函数参数  ：u16 rlr
*函数返回值：void
*描述      ：
********************************************************/
void IWDG_Init(u16 rlr)
{
  //开启内部低速振荡器
  RCC->CSR |= (1<<0);     
  while(!(RCC->CSR & (1<<1)));//等待内部低速振荡器开启完成
  
  //关键字寄存器   输入0x5555 解除写保护
  IWDG->KR = 0x5555;
  //预分频器寄存器   32分频
  IWDG->PR |= (3<<0);
  //重载寄存器
  IWDG->RLR = rlr;
  //开启前必须喂一次狗
  IWDG->KR=0XAAAA;
  
  //启动看门狗
	IWDG->KR = 0xcccc;
}


