#include "stm32f4xx.h"     
#include "beep.h"

/*****************************************************
*函数功能  ：对BEEP对应的GPIO口进行初始化设置
*函数名    ：BEEP_Init
*函数参数  ：void
*函数返回值：void
*描述      ：
             BEEP  PF8
             高电响，低电不响-----输出模式
********************************************************/
void BEEP_Init(void)
{
  //端口时钟使能  GPIOF
  RCC->AHB1ENR |= (1<<5);
  //端口模式配置
  GPIOF->MODER &= ~(3<<8*2);
  GPIOF->MODER |= (1<<8*2);      //通用输出
  //端口输出类型配置
  GPIOF->OTYPER &= ~(1<<8);      //推挽输出
  //端口输出速度配置 
  GPIOF->OSPEEDR &= ~(3<<8*2);
  GPIOF->OSPEEDR |= (2<<8*2);    //速度为50MHz
  //端口输出数据寄存器配置 
	//先将蜂鸣器关闭
  GPIOF->ODR &= ~(1<<8);         //低电不响
}











